-- =========================================================================================================================================================================
-- #version:0000001000
-- =========================================================================================================================================================================
-- historial de cambios
--
-- versión        gap                solicitud        fecha        realizó            descripción
-- -----------    -------------    -------------    ----------    -------------    -----------------------------------------------------------------------------------------
-- 1000                                             22/05/2025      Cesar           Se crea función para activar trigger de update para la tabla ge_standards
-- -----------    -------------    -------------    ----------    -------------    -----------------------------------------------------------------------------------------
-- =========================================================================================================================================================================


CREATE OR REPLACE FUNCTION fn_update_standards_timestamp()
RETURNS TRIGGER AS $$
BEGIN
    NEW.strnd_date_update = CURRENT_TIMESTAMP;
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

CREATE TRIGGER tr_update_standards_timestamp
    BEFORE UPDATE ON ge_standards
    FOR EACH ROW
    EXECUTE FUNCTION fn_update_standards_timestamp();